{"character": "明", "strokes": "8", "radical": "日", "radical variants": [], "radical meaning": ["sun", "day"], "parts": ["日", "月"], "kanji_variants": ["朙"], "meanings": ["bright", "light"], "kun": ["あ.かり", "あか.るい", "あか.るむ", "あか.らむ", "あき.らか", "あ.ける", "-あ.け", "あ.く", "あ.くる", "あ.かす"], "on": ["メイ", "ミョウ", "ミン"], "nanori readings": ["あきら", "あけ", "あす", "きら", "け", "さや", "さやか", "とし", "はる", "み", "め"], "grade": "Jōyō kanji, taught in grade 2", "jlpt": "N4", "frequency": "67", "on reading compounds": ["明【メイ】brightness, clarity, acumen, power of vision, nth year in the Meiji era (1868.9.8-1912.7.30)", "明暗【メイアン】light and darkness, light and shade", "光明【コウミョウ】bright light, hope, bright future, light emanating from a buddha or bodhisattva, symbolizing their wisdom and compassion", "英明【エイメイ】intelligent, wise, bright, brilliant, clear-sighted", "明【ミョウ】vidya (wisdom), mantra, the coming (July 4, etc.)", "明日【アシタ】tomorrow, near future", "光明【コウミョウ】bright light, hope, bright future, light emanating from a buddha or bodhisattva, symbolizing their wisdom and compassion", "内明【ナイミョウ】adhyatmavidya (inner studies, ancient Indian philosophy)", "明【ミン】Ming dynasty (China, 1368-1644)", "明楽【ミンガク】Ming-era Chinese music (popularized in Japan during the early 17th century)"], "kun reading compounds": ["明かり【あかり】light, illumination, glow, gleam, lamp, light", "明り先【あかりさき】source of light", "明るい【あかるい】light, well-lit, well-lighted, bright (of a colour), brightly-coloured, brightly-colored, cheerful, bright, spirited, sunny (e.g. disposition), encouraging (for the future of a project, etc.), promising, of fair prospects, familiar (with), knowledgeable (about), well versed (in), fair (e.g. politics), clean, impartial", "明るむ【あかるむ】to brighten, to grow light", "明らむ【あからむ】to become luminous at dawn (esp. the sky)", "明らか【あきらか】clear, obvious, evident, plain, definite, bright, light", "明らかにする【あきらかにする】to make clear, to clarify, to disclose, to make public", "開ける【あける】to open (a door, etc.), to unwrap (e.g. parcel, package), to unlock, to open (for business, etc.), to empty, to remove, to make space, to make room, to move out, to clear out, to be away from (e.g. one's house), to leave (temporarily), to dawn, to grow light, to end (of a period, season), to begin (of the New Year), to leave (one's schedule) open, to make time (for), to make (a hole), to open up (a hole)", "開く【あく】to open (e.g. doors), to open (e.g. business, etc.), to be empty, to be vacant, to be available, to be free, to be open (e.g. neckline, etc.), to have been opened (of one's eyes, mouth, etc.), to come to an end, to open (one's eyes, mouth, etc.), to have a hole, to form a gap, to have an interval (between events)", "明くる【あくる】next (day, morning, etc.), following", "明くる【あくる】next (day, morning, etc.), following", "あくる日【あくるひ】next day, following day", "明かす【あかす】to pass (the night), to spend, to reveal, to divulge, to disclose, to expose, to prove, to verify"]}